cf_billing/Documents/бестЗагруженныеДанныеИзВнешнихИсточников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестЗагруженныеДанныеИзВнешнихИсточников</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлДляЧтения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПредоставленныеОбъемы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>День</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Час</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗагруженныеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Район</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектРасчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчетаИзФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаУчетаИзФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бестВидыОпераций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГотовКОбработке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчитыватьКоэффициентПУ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Показания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектРасчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаУчетаИзФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчетаИзФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектРасчетаИзФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяЗона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяЗонаИзФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шкала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШкалаИзФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Район</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГотовКОбработке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/бестДанныеПочасовойВедомостиСрез.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестДанныеПочасовойВедомостиСрез</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьКоэффициентПУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>День</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Час</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Documents/бестЗагруженныеДанныеИзВнешнихИсточников/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура - Заместить информацию
//
Процедура ЗаместитьИнформацию() Экспорт
	Запрос = Новый Запрос;
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = ПолучитьТекстЗапросаДляЗаполненияСреза();
	Запрос.УстановитьПараметр("ЗагруженныеДанные", ЗагруженныеДанные.Выгрузить());
	Запрос.УстановитьПараметр("ПредоставленныеОбъемы", ПредоставленныеОбъемы.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();

	ТекОрганизация 			= Неопределено;
	ТекРайон 				= Неопределено;
	ТекПериодНачисления 	= Неопределено;
	ТекМКД 					= Неопределено;
	МассивОбъектов			= Неопределено;
	
	Обработка = Обработки.бестРаботаСПоследовательностямиНП.Создать();
	Пока Выборка.Следующий() Цикл
		Если ТекОрганизация <> Выборка.Организация
			Или ТекРайон <> Выборка.Район 
			Или ТекПериодНачисления <> Выборка.ПериодНачисления
			Или ТекМКД <> Выборка.МКД Тогда
			
			Если МассивОбъектов <> Неопределено Тогда
				Обработка.ЗаполнитьДанныеПочасовойВедомостиСрез(ТекОрганизация, ТекРайон, ТекМКД, Ложь, ТекПериодНачисления, МассивОбъектов); 
			КонецЕсли;
			
			ТекОрганизация 			= Выборка.Организация;
			ТекРайон 				= Выборка.Район;
			ТекПериодНачисления 	= Выборка.ПериодНачисления;
			ТекМКД 					= Выборка.МКД;
			МассивОбъектов 			= Новый Массив;
			
		КонецЕсли; 
		
		МассивОбъектов.Добавить(Выборка.ОбъектРасчета);
	КонецЦикла;
	
	Если МассивОбъектов <> Неопределено Тогда
		Обработка.ЗаполнитьДанныеПочасовойВедомостиСрез(ТекОрганизация, ТекРайон, ТекМКД, Ложь, ТекПериодНачисления, МассивОбъектов); 
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = "ВЫБРАТЬ
		|	СтрокиСПустымиОбъемами.День КАК День,
		|	СтрокиСПустымиОбъемами.Час КАК Час,
		|	СтрокиСПустымиОбъемами.IDСтроки КАК IDСтроки,
		|	бестДанныеПочасовойВедомостиСрез.Объем КАК Объем
		|ИЗ
		|	СтрокиСПустымиОбъемами КАК СтрокиСПустымиОбъемами
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестДанныеПочасовойВедомостиСрез КАК бестДанныеПочасовойВедомостиСрез
		|		ПО СтрокиСПустымиОбъемами.Организация = бестДанныеПочасовойВедомостиСрез.Организация
		|			И бестДанныеПочасовойВедомостиСрез.Район = СтрокиСПустымиОбъемами.Район
		|			И бестДанныеПочасовойВедомостиСрез.МКД = СтрокиСПустымиОбъемами.МКД
		|			И бестДанныеПочасовойВедомостиСрез.ОбъектРасчета = СтрокиСПустымиОбъемами.ОбъектРасчета
		|			И бестДанныеПочасовойВедомостиСрез.ТочкаУчета = СтрокиСПустымиОбъемами.ТочкаУчета
		|			И бестДанныеПочасовойВедомостиСрез.ПериодНачисления = СтрокиСПустымиОбъемами.ПериодНачисления
		|			И бестДанныеПочасовойВедомостиСрез.День = СтрокиСПустымиОбъемами.День
		|			И бестДанныеПочасовойВедомостиСрез.Час = СтрокиСПустымиОбъемами.Час";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл   
		Отбор = Новый Структура();
		Отбор.Вставить("День", Выборка.День);   
		Отбор.Вставить("Час", Выборка.Час);
		Отбор.Вставить("IDСтроки", Выборка.IDСтроки);
		ДополняемаяСтрока = ПредоставленныеОбъемы.НайтиСтроки(Отбор);
		Если ДополняемаяСтрока.Количество() <> 0 Тогда
			ДополняемаяСтрока[0].Объем = Выборка.Объем;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;

	МассоваяЗагрузка = Неопределено;
	ДополнительныеСвойства.Свойство("МассоваяЗагрузка", МассоваяЗагрузка);
	Если МассоваяЗагрузка = Неопределено Или Не МассоваяЗагрузка Тогда
		ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	КонецЕсли;
	
	Ответственный 				= Пользователи.ТекущийПользователь();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТекстЗапросаДляЗаполненияСреза()
	Возврат "ВЫБРАТЬ
	        |	ЗагруженныеДанные.Организация КАК Организация,
	        |	ЗагруженныеДанные.Район КАК Район,
	        |	ЗагруженныеДанные.ОбъектРасчета КАК ОбъектРасчета,
	        |	ЗагруженныеДанные.ПериодНачисления КАК ПериодНачисления,
	        |	ЗагруженныеДанные.ГотовКОбработке КАК ГотовКОбработке,
	        |	ЗагруженныеДанные.IDСтроки КАК IDСтроки,
	        |	ЗагруженныеДанные.ТочкаУчета КАК ТочкаУчета
	        |ПОМЕСТИТЬ ТЧЗагруженныеДанные
	        |ИЗ
	        |	&ЗагруженныеДанные КАК ЗагруженныеДанные
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПредоставленныеОбъемы.День КАК День,
	        |	ПредоставленныеОбъемы.Час КАК Час,
	        |	ПредоставленныеОбъемы.Объем КАК Объем,
	        |	ПредоставленныеОбъемы.IDСтроки КАК IDСтроки
	        |ПОМЕСТИТЬ ПредоставленныеОбъемы
	        |ИЗ
	        |	&ПредоставленныеОбъемы КАК ПредоставленныеОбъемы
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ТЧЗагруженныеДанные.Организация КАК Организация,
	        |	ТЧЗагруженныеДанные.Район КАК Район,
	        |	ТЧЗагруженныеДанные.ОбъектРасчета КАК ОбъектРасчета,
	        |	ТЧЗагруженныеДанные.ПериодНачисления КАК ПериодНачисления,
	        |	ПредоставленныеОбъемы.День КАК День,
	        |	ПредоставленныеОбъемы.Час КАК Час,
	        |	ПредоставленныеОбъемы.Объем КАК Объем,
	        |	ПредоставленныеОбъемы.IDСтроки КАК IDСтроки,
	        |	ТЧЗагруженныеДанные.ТочкаУчета КАК ТочкаУчета,
	        |	бестОбъектыРасчета.МКД КАК МКД
	        |ПОМЕСТИТЬ СтрокиСПустымиОбъемами
	        |ИЗ
	        |	ТЧЗагруженныеДанные КАК ТЧЗагруженныеДанные
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПредоставленныеОбъемы КАК ПредоставленныеОбъемы
	        |		ПО ТЧЗагруженныеДанные.IDСтроки = ПредоставленныеОбъемы.IDСтроки
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	        |		ПО ТЧЗагруженныеДанные.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	        |ГДЕ
	        |	ТЧЗагруженныеДанные.ГотовКОбработке
	        |	И ПредоставленныеОбъемы.Объем = -1
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	СтрокиСПустымиОбъемами.Организация КАК Организация,
	        |	СтрокиСПустымиОбъемами.Район КАК Район,
	        |	СтрокиСПустымиОбъемами.ОбъектРасчета КАК ОбъектРасчета,
	        |	СтрокиСПустымиОбъемами.ПериодНачисления КАК ПериодНачисления,
	        |	бестОбъектыРасчета.МКД КАК МКД
	        |ИЗ
	        |	СтрокиСПустымиОбъемами КАК СтрокиСПустымиОбъемами
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	        |		ПО СтрокиСПустымиОбъемами.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	Организация,
	        |	Район,
	        |	ПериодНачисления";
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
